{"request": "I want some sports games.", "plan": "1. hard condition filter tool (for sports games); 2. map tool"}
{"request": "I have played a lot of card games, like Duelyst, Minion Masters, Labyrinth, Catan Universe. Catan Universe is my favorite games, but Duelyst and Minion Masters make me disgusted. Can you recommend some popular games released after 2016, similar with Catan Universe?", "plan": "1. hard condition filter tool (for popular games released after 2016); 2. soft condition filter tool (similar with Catan Universe); 3. ranking tool (user history: Duelyst, Minion Masters, Labyrinth, Catan Universe; user dislikes Duelyst and Minion); 4. map tool"}
{"request": "I have played Call of Duty and Rust in the past, please suggest me some games.", "plan": "1. ranking tool (user has played Call of Duty and Rust); 2. map tool"}
{"request": "I am looking for some games similar to Football Manager, do you have any suggestions?", "plan": "1. soft condition filter tool (similar to Foolball Manager); 2. map tool"}
{"request": "Give me some shooting or sports games, but I don't like first-person games.", "plan": "1. hard condition filter tool (shooting or sports games, not first-person games); 2. map tool"}
{"request": "I'm looking for some sports games like NBA 2K, but I want a cheaper one.", "plan": "1. look up tool (price of NBA 2K); 2. hard condition filter tool (sports games, cheaper than the price of NBA 2K); 2. soft condition filter tool (similar to NBA 2K); 3. map tool"}
{"request": "I used to play NBA 2K and Rust, but now I feel bored of them. Please give 3 some new games.", "plan": "1. hard condition filter tool (released in recent years); 2. ranking tool (user has played NBA 2K and Rust, user doesn't want the two games); 3. map tool"}
{"request": "I want some sports games to play, but I don't like NBA 2k and Football Manager.", "plan": "1. hard condition filter tool (sports games); 2. ranking tool (user dislikes NBA 2k and Football Manager); 3. map tool"}
{"request": "Please give me details about the game NBA 2K.", "plan": "1. look up tool (game description about NBA 2K)"}
{"request": "How much does the game cost?", "plan": "1. look up tool (price of the game)"}
{"request": "I have played Rust and Portal, which game suit me most in the recommendation list?", "plan": "1. candidate store tool (store games in recommendation list as candidates); 2. ranking tool (rank the candidates according to play history); 3. map tool"}
{"request": "I have played NBA2K, refine the recommendation list for me.", "plan": "1. candidate store tool (store games in recommendation list as candidates); 2. ranking tool (rank the candidates according to play history); 3. map tool"}
{"request": "Which games are first-person in above list?", "plan": "1. candidate store tool (store games in above list as candidates); 2. hard condition tool (filter first-person games from candidates); 3. map tool"}
{"request": "I want some puzzle games, such as Sudoku, do you have any suggestions?", "plan": "1. hard condition tool (filter puzzle games from candidates); 2. soft condition tool (similar to Sudoku); 3. map tool"}