{"request": "I want some TAG games.", "plan": "1. hard condition filter tool (for TAG games); 2. ranking tool (by popularity); 3. map tool"}
{"request": "I have played a lot of TAG games, like GAME1, GAME2, GAME3, GAME4. GAME3 is my favorite games, but GAME1 and GAME2 make me disgusted. Can you recommend some popular games released after 2016, similar with GAME4?", "plan": "1. hard condition filter tool (released after 2016); 2. soft condition filter tool (similar with GAME4); 3. ranking tool (user history: GAME1, GAME2, GAME3, GAME4; user unwants GAME1 and GAME2); 4. map tool"}
{"request": "I have played GAME1 and GAME2 in the past, please suggest me some games.", "plan": "1. ranking tool (user history GAME1 and GAME2, by preference); 2. map tool"}
{"request": "I am looking for some games similar to GAME, do you have any suggestions?", "plan": "1. soft condition filter tool (similar to GAME); 2. ranking tool (by similarity); 3. map tool"}
{"request": "Give me some TAG1 or TAG2 games, but I don't like TAG3 games.", "plan": "1. hard condition filter tool (TAG1 or TAG2 games, not TAG3 games); 2. ranking tool (by popularity); 3. map tool"}
{"request": "I'm looking for some TAG games like GAME, but I want a cheaper one.", "plan": "1. look up tool (price of GAME); 2. hard condition filter tool (TAG games, cheaper than the price of GAME); 2. soft condition filter tool (similar to GAME); 3. ranking tool (by similarity); 4. map tool"}
{"request": "I used to play GAME1 and GAME2, but now I feel bored of them. Please give 3 some new games.", "plan": "1. hard condition filter tool (released in recent years); 2. ranking tool (user has played GAME1 and GAME2, user doesn't want the two games; by preference); 3. map tool"}
{"request": "I want some TAG games to play, but I don't like GAME1 and GAME2.", "plan": "1. hard condition filter tool (TAG games); 2. ranking tool (user unwants GAME1 and GAME2; by preference); 3. map tool"}
{"request": "Please give me details about the game GAME.", "plan": "1. look up tool (game description about GAME)"}
{"request": "How much does the game cost?", "plan": "1. look up tool (price of the game)"}
{"request": "I have played GAME1 and GAME2, which game suits me most in the recommendation list?", "plan": "1. candidate store tool (store games in above recommendation list as candidates); 2. ranking tool (rank the candidates according to history: GAME1, GAME2, by preference); 3. map tool"}
{"request": "I have played GAME, refine the recommendation list for me.", "plan": "1. candidate store tool (store games in recommendation list as candidates); 2. ranking tool (rank the candidates according to play history GAME, by preference); 3. map tool"}
{"request": "Which games are TAG in above list?", "plan": "1. candidate store tool (store games in above list as candidates); 2. hard condition tool (filter TAG games from candidates); 3. map tool"}
{"request": "I want some TAG games, such as GAME, do you have any suggestions?", "plan": "1. hard condition tool (filter TAG games from candidates); 2. soft condition tool (similar to GAME); 3. map tool"}